#include <iostream>
#include <cstdlib>
#include <ctime>
#include <Windows.h>
#include <conio.h>
#include <string>

using namespace std;

int coin = 100;//货币 
int live = 100;//生命 
int lv = 1;//装备等级 
int redstore = 0;//进阶石
int place = 1; // 地区设置,1为初始村庄
int timez;

int bag[2] = {0, 0};//背包 1:渔网 2:斧头 

/*剪贴板施工
cout << "-------------------------------------------------------------------------------" << endl;
cout << "" << endl;
print();
print("");
*/

string print(string ch,int next = 1, int sget = 1) { //输入字符串 
	string s; //为下文getch做准备，无含义 
	for (int i = 0; i <= int(ch.size()); i++) {
		cout << ch[i]; //输出字符串第i项
		Sleep(timez);//0.05s 
	}
	Sleep(timez*10);
	if (next == 1){//关键词为1时正常输出 
		cout<<" 按任意键继续"<<endl;
	}else if (next == 0){//为0时仅换行 
		cout << endl;
	}//为其它时啥也不做 
	
	if (sget){	
	s=getch();//输入任意文字 
	}	
	return s;
}

int killer() {
	
	srand(time(NULL));//随机数 
	
	cout << "==========================你遇到了敌人！==========================" << endl;
	
	int mon_l = place * 10;
	
	cout << "你遇到了「Lv." << place << "」等级的敌人!" << place;//地区即等级 
	print("");
	cout << "你的血量:" << live;
	print("");
	cout << "怪物血量:" << mon_l;
	print("");
	while (true){
		live -= int(place * 9 / (lv + rand() % 5));//减生命 等级的9倍/防御+0~4 
		cout << "怪物攻击了你!你还剩「" << live << "」点血量!";   
		print("");
		if (live <= 0){
			print( "GAME OVER");
			break;
		}
		if (rand() % 3 == 1){
			mon_l -= 2 * (lv * 10 - rand() % 5); //减怪物生命 攻击力的10倍-0 ~ 5
			cout << "暴击!";
			print("");
		}
		else{
			mon_l -= lv * 10 - rand() % 5;
		}
		if (mon_l < 0){
			mon_l = 0;
		}
		cout << "你攻击了怪物!怪物还剩「" << mon_l << "」点血量!"; 
		print("");  
		if (mon_l <= 0){
			cout << "你打败了怪物！";
			print("");
			coin += place * 9 + rand() % 12; //加钱 等级*9+0~12 
			cout << "你现在有「" << coin << "」个货币!";
			print("", 2);
			cout << "以及「" << live << "」点血量！";
			print("");
			break;
		} 
		
	}
	
	cout << "==================================================================" << endl;
	
	return 0;
}

int main() {

	int mainz = 1; // 主线推进 
	int placel; // 地中区 
	int user; // 用户选择 

	bool lake = true; //为下面树林处的湖准备
	bool tree = true; //为下面树林山洞口的树作准备 

	// 游玩须知
	cout << "==========================游玩须知==========================" << endl;
	cout << "本游戏是由一位屑初中生用c++编写的文字RPG游戏，可能会有bug" << endl;
	cout << "请不要在选项时输入除整数以外的所有字符" << endl;
	cout << "如果有些地方你什么都不想选可以输入除文中以外的序号" << endl;
	cout << "此游戏没有存档" << endl;
	cout << "GLHF" << endl;
	cout << "==========================游玩须知==========================" << endl;
	string op;//以下为按k设置文字速度 
	op = print("");
	timez = 30;
	if (op == "k") {
		cin >> timez;
	}

	// 初始剧情 
	cout << "-------------------------------------------------------------------------------" << endl;
	print("你是一名勇者");
	print("平常，你会去周边打一些怪物度日");
	print("可是今天却不一样");
	print("你找到了一块泛着蓝光的石头");
	print("你决定找村长去问一下这块“石头”有什么用");
	cout << "-------------------------------------------------------------------------------" << endl;

	while (true) {
		if (place == 1) { // 初始村庄
			cout << "-------------------------------------------------------------------------------" << endl;
			print("你要去哪？", 0, 0);
			print("1.村长家 2.小k百货铺 3.小y装备店 4.往前走", 0, 0);
			cout << "-------------------------------------------------------------------------------" << endl;
			cin >> placel;

			// 村长家 
			if (placel == 1) {
				cout << "-------------------------------------------------------------------------------" << endl;
				if (mainz == 1) { // 判断主线剧情进度 
					print("你：村长，我找到了一块泛着蓝光的石头");
					print("村长：哦？让我看看");
					print("你掏出了石头");
					print("村长：这……好像就是传说中的“蓝色符石”！");
					print("你：？");
					print("村长：传说，只有被选中的人才能找到它。然后一直向东走就能找到很牛牛的宝藏！");
					print("你:WOW!");
					print("村长：你从哪里找到它的？");
					print("你：从史莱姆的尸体中找到的");
					print("村长：……");
					print("村长：这是我们村祖传的宝剑与宝甲，就送给你了，你可以去「小y装备店」强化它们，good luck");
					print("你：谢谢村长");
					mainz++;
				}
				else {
					print("村长：祝你好运！找到宝藏后分我一点");
				}
				cout << "-------------------------------------------------------------------------------" << endl;
			}

			//小k杂货铺
			if (placel == 2) {
				cout << "-------------------------------------------------------------------------------" << endl;
				print("小k：你好！勇者");
				cout << "你还有" << coin << "个货币";
				print("");
				print("你要买什么？", 0, 0);
				print("1.生命药水30$ 2.龟苓膏114514$", 0, 0);
				cin >> user;
				if (user == 1) {//生命药水 
					if (coin >= 30) {//钱数 
						live += 20;//加生命 
						if (live > 100) {//生命值大于100 
							live = 100;
						}
						coin -= 30;//扣钱 
						cout << "你还有" << coin << "个货币" << endl;//输出剩余的钱 
						print("");
						cout << "你现在有" << live << "生命值" << endl;
						print("");
					}
					else {
						print("你的钱不够");
						print("");
					}
				}
				else if (user == 2) {
					if (coin >= 114514) {
						coin -= 114514;
						print("好臭啊");
						print("恭喜通关！");
						break;
					}
					else {
						print("你的钱不够");
					}
					cout << "-------------------------------------------------------------------------------" << endl;
				}
			}

			//小y装备店
			if (placel == 3) {
				if (mainz == 2) {
					cout << "-------------------------------------------------------------------------------" << endl;
					print("小y：你好！我们的勇者！");
					print("你：e，我想要咨询一下关于我们村宝剑与宝甲强化之类的");
					print("小y：wow！让我看看……");
					print("小y：我觉得这剑与甲需要一种红红的，唤作进阶石的矿石来强化，可以在一些野外的箱子中找到它们");
					print("小y：当你找到了以后可以来找我，你先看看价钱吧");
					mainz++;

				}
				cout << "-------------------------------------------------------------------------------" << endl;
				cout << "你还有" << coin << "个货币";
				print("");
				print("你要强化么？50$", 0, 0);
				print("1.强化 2.算了", 0, 0);
				cin >> user;
				if (user == 1) {
					if (coin >= 50) {
						if (redstore >= 1) {//进阶石判断
							coin -= 50;
							redstore -= 1;
							lv += 1; //装备等级+1
							cout << "你现在有货币:" << coin << "  进阶石:" << redstore << "  攻击力:" << lv << "  防御力:" << lv << endl;
							print("");
						}
						else {
							print("你没有足够的进阶石");
						}
					}
					else {
						print("你没有足够的货币");
					}
					cout << "-------------------------------------------------------------------------------" << endl;
				}
			}

			//往前走
			if (placel == 4) {
				killer();
				if (live <= 0) {
					break;
				}
				place++;
			}
		}
		if (place == 2) { //山洞 
			cout << "-------------------------------------------------------------------------------" << endl;
			if (mainz == 3) {
				print("你来到了一个山洞");
				while (true) {
					print("往哪边走?", 0, 0);
					print("1.往左走 2.往右走 3.返回村庄", 0, 0);
					cin >> user;
					if (user == 1) {
						print("往哪边走?", 0, 0);
						print("1.往左走 2.往右走", 0, 0);
						cin >> user;
						if (user == 2) {
							print("往哪边走?", 0, 0);
							print("1.往左走 2.往右走", 0, 0);
							cin >> user;
							if (user == 2) {
								print("往哪边走?", 0, 0);
								print("1.往左走 2.往右走", 0, 0);
								cin >> user;
								if (user == 1) {
									print("往哪边走?", 0, 0);
									print("1.往左走 2.往右走", 0, 0);
									cin >> user;
									if (user == 1) {
										print("往哪边走?", 0, 0);
										print("1.往左走 2.往右走", 0, 0);
										cin >> user;
										if (user == 1) {
											print("你走出了山洞");
											print("你发现了一块红红的进阶石");
											redstore++;
											mainz++;
											break;
										}
									}
								}
							}
						}
					}
					else if (user == 3) {
						killer();
						if (live <= 0) {
							break;
						}
						place--;
					}
					print("你绕回了入口");
				}
			}
			else if (mainz < 3) {
				print("你觉得这里你还不该来");
				print("1.返回村庄");
				cin >> placel;
				if (placel == 1) {
					killer();
					if (live <= 0) {
						break;
					}
					place--;
				}
			}
			else if (mainz > 3) {
				print("你要去哪?", 0, 0);
				print("1.返回村庄 2.往前走", 0, 0);
				cin >> placel;
				if (placel == 1) {
					killer();
					if (live <= 0) {
						break;
					}
					place--;
				}
				if (placel == 2) {
					killer();
					if (live <= 0) {
						break;
					}
					place++;
				}
			}

		}
		if (place == 3) { //小坡村
			cout << "-------------------------------------------------------------------------------" << endl;
			print("你要去哪?", 0, 0);
			print("1.返回山洞 2.EZ酒吧 3.喵喵杂货店 4.往前走", 0, 0);
			cout << "-------------------------------------------------------------------------------" << endl;
			cin >> placel;
			if (placel == 1) {
				killer();
				if (live <= 0) {
					break;
				}
				place--;
			}
			if (placel == 4) {
				killer();
				if (live <= 0) {
					break;
				}
				place++;
			}
			if (placel == 2) {
				cout << "-------------------------------------------------------------------------------" << endl;
				if (mainz == 4) {
					print("酒吧老板：哟！这不是隔壁村的勇者吗？");
					print("你：我想来打听一下关于“蓝色符石”的事情");
					print("酒馆老板：“蓝色符石”？那可是传说中被选中的人才能找到的啊");
					print("酒馆老板：你难道有？");
					print("你拿出了那颗蓝色的石头");
					print("酒馆老板：*13号脏话*");
					print("酒馆老板：……其实我也知道一些关于“蓝色符石”的消息……");
					print("酒馆老板：曾经有一位客人说在我们小坡村东面有一座山洞，山洞口有一扇铁门，上面有一个石头样的凹槽");
					print("酒馆老板：对，就跟你手上的这颗石头差不多");
					print("酒馆老板：在那之后，有人去找过山洞，可都没有看到铁门，只有一堵怎么也打不破的石墙");
					print("酒馆老板：想想也是，不是天选之人怎么可能找到呢？");
					print("酒馆老板：我也只能帮你到这了，你去碰碰运气吧，找到就分我一点");
					print("酒馆老板：对了，你要喝酒吗？（未成年人禁止饮酒）");
					mainz++;
				}
				cout << "你还有「" << coin << "」个货币！";
				print("");
				print("你要买一杯酒吗？(50%加血 50%扣血)", 0, 0);
				print("1.买$20 2.算了", 0, 0);
				cin >> user;
				if (user == 1) {
					if (coin >= 20) {//货币判断
						coin -= 20;
						srand(time(NULL));//随机数 
						if (rand() % 2) {//随机数0或1判断
							live += 20;//加生命 
							print("你感到很棒");
							if (live > 100) {//生命值大于100 
								live = 100;
							}
						}
						else {
							live -= 20;
							print("你感到很难受");
							if (live <= 0) {
								print("GAME OVER");
								break;
							}
						}
						cout << "你还有" << coin << "个货币";//输出剩余的钱 
						print("");
						cout << "你现在有" << live << "生命值";
						print("");
					}
					else {
						print("你没有足够的货币");
					}
				}
				cout << "-------------------------------------------------------------------------------" << endl;
			}
			if (placel == 3) {
				cout << "-------------------------------------------------------------------------------" << endl;
				print("喵老板：欢迎光临！");
				print("喵老板：您要买什么？", 0, 0);
				print("1.渔网$40 2.生命药水$30 3.斧头$50", 0, 0);
				if (user == 2) {//生命药水 
					if (coin >= 30) {//钱数 
						live += 20;//加生命 
						if (live > 100) {//生命值大于100 
							live = 100;
						}
						coin -= 30;//扣钱 
						cout << "你还有" << coin << "个货币";//输出剩余的钱 
						print("");
						cout << "你现在有" << live << "生命值";
						print("");
					}
					else {
						print("你的钱不够");

					}
				}
				else if (user == 1) {
					if (coin >= 40) {
						coin -= 40;
						bag[0] = 1;//将“背包”数组中表示渔网的变量变为1 
						print("你获得了「渔网」！");
						cout << "你还有" << coin << "个货币";//输出剩余的钱 
						print("");
					}
					else {
						print("你的钱不够");
					}
				}
				else if (user == 3) {
					if (coin >= 50) {
						coin -= 50;
						bag[1] = 1;//将“背包”数组中表示斧头的变量变为1 
						print("你获得了「斧头」！");
						cout << "你还有" << coin << "个货币";//输出剩余的钱 
						print("");
					}
					else {
						print("你的钱不够");
					}
				}
				print("喵老板：欢迎下次光临！");
				cout << "-------------------------------------------------------------------------------" << endl;
			}
		}
		if (place == 4) {
			if (mainz == 5) {
				print("这里是一片异常茂密的树林");
				print("可是为了宝藏，啊不，大家的期待");
				print("你还是决定深入其中");
				print("你发现树林中有一片湖和一座山");
				print("山前似乎有一个山洞");
				print("但这里似乎很久没有人来了，山洞前长了几棵异常坚硬的树");
				print("说实话，这里还挺美的……");
				mainz++;
			}
			else if (mainz < 5) {
				print("你发现这是一片异常茂密的树林");
				print("你害怕迷路，所以返回了小坡村");
				killer();
				if (live <= 0) {
					break;
				}
				place--;
			}
			if (mainz > 5) {
				print("你去要哪？", 0, 0);
				print("1.回小坡村 2.到湖边 3.到山前", 0, 0);
				cin >> placel;
				if (placel == 1) {
					killer();
					if (live <= 0) {
						break;
					}
					place--;
				}
				if (placel == 2) {
					print("你来到了湖边");
					if (lake) { //防止描述出现重复 
						print("你发现这里的湖还挺清澈的");
						print("你发现水下好像有红红的晶体在闪烁");
						print("可是水看起来很深，水草很多，你不敢下水");
						print("你需要一个渔网把它捞起来");
						lake = false; //设置lake下次就不会出现以上描述 
					}
					if (bag[0]) {
						print("使用渔网吗？", 0, 0);
						print("1.yes 2.no", 0, 0);
						cin >> user;
						if (user == 1) {
							print("你使用渔网打捞了水中的晶体");
							print("你打捞上了一块红红的进阶石！");
							redstore++;
						}
					}
					else {
						print("你没有渔网");
					}
				}
				if (placel == 3) {
					print("你来到了山前");
					if (tree) { //防止描述出现重复 
						print("虽说酒馆老板说有人来找过这山洞");
						print("但按照酒馆老板的习惯，这应该是十几年前的事了");
						print("这里的树长了十几年了，虽然不高，但异常茂密，你挤不进山洞");
						print("你需要一把斧头把它们砍了");
						tree = false; //设置lake下次就不会出现以上描述 
					}
					if (bag[1]) {
						print("使用斧头吗？", 0, 0);
						print("1.yes 2.no", 0, 0);
						cin >> user;
						if (user == 1) {
							print("你使用斧头砍掉了山洞前的树");
							print("你发现山洞里确实有一扇铁门");
							print("铁门上也如传闻中的一样有一个“蓝色符石”样的凹槽");
							print("要嵌入“蓝色符石”吗？", 0, 0);
							print("1.yes 2.no", 0, 0);
							cin >> user;
							if (user == 1) {
								print("你嵌入了“蓝色符石”");
								print("……");
								print("……");
								print("*一阵巨响");
								print("在经历了像地震一样的山崩地裂后，“蓝色符石”碎了，而也门打开了");
								print("……");
								print("你：“WC!!!!!巨龙！！！！！”");
								print("*看来这就是最终试炼了……");
								print("巨龙向你发起了挑战！");
								if (lv == 3) {
									print("你还在震惊当中，巨龙已经向你发射了一口火球");
									print("你没来得及躲开，但是你的宝甲闪了两下，挡住了火球然后破掉了");
									print("你回过神来，握着宝剑像巨龙奔去，宝剑闪了两下，你正中要害，巨龙倒地，宝剑也随之破裂");
									print("巨龙倒地后化作一堆财宝……");
									print("*你战胜了巨龙！");
									print("你感到有说不出的喜悦，一想到一个巨龙大的财宝将要归你所有，你感到异常兴奋");
									print("突然，财宝中的一个卷轴吸引了你的注意力……");
									print("上面写着：“这些财宝每一个都有上一代巨龙留下的魔力，只要吃下它们便可变得异常强大", 0);
									print("            放心，只要念出以下咒语便可拥有钻牙金胃，食财宝不在话下”", 0);
									print("你往下看，果然写着咒语，你读了出来:", 2);
									print("屠龙勇者终成恶龙");
									print("恭喜通关！！！！！！", 0);
								}
								else if (0 < lv && lv < 3) {
									print("你还在震惊当中，巨龙已经向你发射了一口火球");
									print("虽说是宝甲，但也难以承受，碎掉了");
									print("巨龙见状，一脚踩来");
									print("你承受不住如此巨大压力，直接被踩成一滩灰，融入沙土中，你的宝剑也被巨龙拾去，给吞了");
									print("而你的灵魂凝作一块蓝色的石头，等待有缘人为你报仇……");
									print("胜败乃兵家常事，请大侠重新来过");
								}
								else {
									while (true) {
										print("你个纪狗！");
									}
								}
							}
						}
						else {
							print("你没有斧头");
						}
					}
				}
			}
		}
	}
	return 0;
}
